:PROPERTIES:
:ID:       b4aec5d0-2ee8-40c3-b1cf-937737d465e6
:END:
#+TITLE: Pipewire


*** pw-dump

To dump current config, use =pw-dump=

#+begin_src shell :results output code :wrap example json
pw-dump | jq '[(length), (map(.type) | unique)]'
#+end_src

#+RESULTS:
#+begin_example json
[
  97,
  [
    "PipeWire:Interface:Client",
    "PipeWire:Interface:Core",
    "PipeWire:Interface:Device",
    "PipeWire:Interface:Factory",
    "PipeWire:Interface:Link",
    "PipeWire:Interface:Metadata",
    "PipeWire:Interface:Module",
    "PipeWire:Interface:Node",
    "PipeWire:Interface:Port",
    "PipeWire:Interface:Profiler",
    "PipeWire:Interface:SecurityContext"
  ]
]
#+end_example

And recombine with things like this.

#+begin_example jq
map(select(.type == "PipeWire:Interface:Module") | .info.name)
#+end_example

What's a factory?

#+begin_example jq
map(select(.type == "PipeWire:Interface:Factory") | .info.props | keys)
| flatten | unique
#+end_example

**** Selecting Nodes

And selecting the =id= for a node, given it's name (or maybe description)

This selects out the nodes without the metadata

#+begin_example jq
map(select(.type == "PipeWire:Interface:Node") | [.id, .info.props])

#+end_example

This makes some things a bit more clear

#+begin_example jq
map(select(.type == "PipeWire:Interface:Node")
  | [.id # include the .id
    , (.info.props | keys) # just the keys
    , (.info.props | to_entries | map(.value)) # just the values
])
#+end_example

Grep this output for the id. maybe add some selectors idk

#+begin_src shell
q='map(select(.type == "PipeWire:Interface:Node") | [.id, (.info.props."node.name")]) | map(@csv) | join("\n")'
pw-dump | jq --raw-output "$q"
#+end_src

#+RESULTS:
|  31 | Dummy-Driver                                                        |
|  32 | Freewheel-Driver                                                    |
|  33 | Microphone-Proxy                                                    |
|  34 | Main-Output-Proxy                                                   |
|  59 | Midi-Bridge                                                         |

**** SystemD Configuration

The docs mention a [[https://pipewire.pages.freedesktop.org/wireplumber/daemon/multi_instance.html#systemd-integration][wireplumber systemd template unit]] that allows you to switch profiles
quickly. Here's how to define a [[https://pipewire.pages.freedesktop.org/wireplumber/daemon/configuration/components_and_profiles.html#config-components-and-profiles][profile]], which is

#+begin_quote
A _profile_ is a collection of _components_ that are loaded together to offer a
certain overall experience.
#+end_quote

Here's wireplumber on my system (for now)

#+name: thisWp
#+begin_src shell :results output verbatim
wp=$(which wireplumber)
wp=$(readlink -f $wp)
wp=$(dirname $wp)/..

echo -n $wp
#+end_src

#+RESULTS: thisWp
: /nix/store/qkqays5xyw27wpnh74qajfx4wbr058m1-wireplumber-0.5.10/bin/..

Wireplumber builds a directory structure like this in =nix= (along with more
contextual information I didn't quite know how to ask about yet)

#+begin_src shell :results output code :wrap example text :var wp=thisWp
tree -I 'locale' -d  $wp
#+end_src

#+RESULTS:
#+begin_example text
/nix/store/qkqays5xyw27wpnh74qajfx4wbr058m1-wireplumber-0.5.10/bin/..
├── bin
├── lib
│   ├── girepository-1.0
│   ├── systemd
│   │   ├── system
│   │   └── user -> ../../share/systemd/user
│   └── wireplumber-0.5
└── share
    ├── systemd
    │   └── user
    ├── wireplumber
    │   ├── scripts
    │   │   ├── client
    │   │   ├── default-nodes
    │   │   ├── device
    │   │   ├── lib
    │   │   ├── linking
    │   │   ├── monitors
    │   │   │   ├── libcamera
    │   │   │   └── v4l2
    │   │   └── node
    │   └── wireplumber.conf.d
    └── zsh
        └── site-functions

25 directories
#+end_example

And here's the systemd unit

#+name: wpSvc
#+begin_src shell :var wp=thisWp :results output code :wrap example conf
# (the build for =systemd-mode= in emacs is broken... so this doesn't work)
# +begin_shell :var wp=thisWp :results output code :wrap example systemd
cat $wp/share/systemd/user/wireplumber.service
#+end_src

#+RESULTS:
#+begin_example conf
[Unit]
Description=Multimedia Service Session Manager
After=pipewire.service dbus.service
BindsTo=pipewire.service
Conflicts=pipewire-media-session.service

[Service]
LockPersonality=yes
MemoryDenyWriteExecute=yes
NoNewPrivileges=yes
SystemCallArchitectures=native
SystemCallFilter=@system-service
Type=simple
ExecStart=/nix/store/qkqays5xyw27wpnh74qajfx4wbr058m1-wireplumber-0.5.10/bin/wireplumber
Restart=on-failure
Slice=session.slice
Environment=GIO_USE_VFS=local

[Install]
WantedBy=pipewire.service
Alias=pipewire-session-manager.service
#+end_example

And the template service

#+name: wpTempSvc
#+begin_src shell :var wp=thisWp :results output code :wrap example conf
cat $wp/share/systemd/user/wireplumber@.service
#+end_src

#+RESULTS:
#+begin_example conf
# Service file to run WirePlumber in split mode, i.e. run multiple
# WirePlumber instances with different module sets.
# The template argument is used to load a specific profile, e.g.
# wireplumber@main.service loads the "main" profile,
# wireplumber@policy.service loads the "policy" profile, etc.
[Unit]
Description=Multimedia Service Session Manager (%i)
After=pipewire.service
BindsTo=pipewire.service
Conflicts=pipewire-media-session.service

[Service]
LockPersonality=yes
MemoryDenyWriteExecute=yes
NoNewPrivileges=yes
SystemCallArchitectures=native
SystemCallFilter=@system-service
Type=simple
ExecStart=/nix/store/qkqays5xyw27wpnh74qajfx4wbr058m1-wireplumber-0.5.10/bin/wireplumber -p %i
Restart=on-failure
Slice=session.slice
Environment=GIO_USE_VFS=local

[Install]
WantedBy=pipewire.service
#+end_example

And their differences. All it does is pass the systemd template parameter to
=./bin/wireplumber -p %i= ... which is um exactly what the docs say this does (and
now I know what that looks like). I've otherwise kinda struggled to identify
_what_ a systemd template is. The high version numbers in =systemd= for docs
improvements and self-documenting features are ummm... not great.

#+begin_src shell :var wp=thisWp :results output code :wrap example diff
# diff <(echo -e $wpS) <(echo -e $wpT)
# echo -n
diff $wp/share/systemd/user/wireplumber{,@}.service
echo -n
#+end_src

#+RESULTS:
#+begin_example diff
0a1,5
> # Service file to run WirePlumber in split mode, i.e. run multiple
> # WirePlumber instances with different module sets.
> # The template argument is used to load a specific profile, e.g.
> # wireplumber@main.service loads the "main" profile,
> # wireplumber@policy.service loads the "policy" profile, etc.
2,3c7,8
< Description=Multimedia Service Session Manager
< After=pipewire.service dbus.service
---
> Description=Multimedia Service Session Manager (%i)
> After=pipewire.service
14c19
< ExecStart=/nix/store/qkqays5xyw27wpnh74qajfx4wbr058m1-wireplumber-0.5.10/bin/wireplumber
---
> ExecStart=/nix/store/qkqays5xyw27wpnh74qajfx4wbr058m1-wireplumber-0.5.10/bin/wireplumber -p %i
21d25
< Alias=pipewire-session-manager.service
#+end_example

